tutorials/combustion/PDRFoam/flamePropagationWithObstacles/0/Aw.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Aw;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 0 0 0 0 0];

internalField   nonuniform List<scalar>
8025
(
18.372496
9.622496
9.811248
15.367797
11.780849
9.622496
5
4.811248
...
)
;

boundaryField
{
    outer
    {
        type            uniformInletOutlet;
        uniformInletValue 0;
        value           uniform 0;
    }

    ground
    {
        type            zeroGradient;
    }

    blockedFaces
    {
        type            zeroGradient;
        value           uniform 0;
    }

    baffleWall
    {
        type            zeroGradient;
        value           uniform 0;
    }

    baffleCyclic_half0
    {
        type            cyclic;
    }

    baffleCyclic_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
