tutorials/combustion/PDRFoam/flamePropagationWithObstacles/0/p.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    outer
    {
        type            waveTransmissive;
        gamma           1.3;
        fieldInf        100000;
        lInf            5;
        value           uniform 100000;
    }

    ground
    {
        type            zeroGradient;
    }

    blockedFaces
    {
        type            zeroGradient;
    }

    baffleWall
    {
        type            zeroGradient;
    }

    baffleCyclic_half0
    {
        type            cyclic;
    }

    baffleCyclic_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
